function [J,dJ] = GetJ(q,index)
%index为编号，如a腿接地为11，b腿下方连接为22，c腿上方连接为33，a腿最上点为14，b腿最上点为24
parameter;
switch index
    case 11
        J=[1 0 0 0 0 0 0 0 0;
            0 1 0 0 0 0 0 0 0];
        dJ=[0 0 0 0 0 0 0 0 0;
            0 0 0 0 0 0 0 0 0];
    case 12
        J=[1 0 Ls*cos(q(3)) 0 0 0 0 0 0;
            0 1 -Ls*sin(q(3)) 0 0 0 0 0 0];
        dJ=[0 0 -Ls*sin(q(3))*q(12) 0 0 0 0 0 0;
            0 0 -Ls*cos(q(3))*q(12) 0 0 0 0 0 0];
    case 13
        J=[1 0 (L-Ls)*cos(q(3)) 0 0 0 0 0 0;
            0 1 -(L-Ls)*sin(q(3)) 0 0 0 0 0 0];
        dJ=[0 0 -(L-Ls)*sin(q(3))*q(12) 0 0 0 0 0 0;
            0 0 -(L-Ls)*cos(q(3))*q(12) 0 0 0 0 0 0];
    case 14
        J=[1 0 L*cos(q(3)) 0 0 0 0 0 0;
            0 1 -L*sin(q(3)) 0 0 0 0 0 0];
        dJ=[0 0 -L*sin(q(3))*q(12) 0 0 0 0 0 0;
            0 0 -L*cos(q(3))*q(12) 0 0 0 0 0 0];
    case 21
        J=[0 0 0 1 0 0 0 0 0;
            0 0 0 0 1 0 0 0 0];
        dJ=[0 0 0 0 0 0 0 0 0;
            0 0 0 0 0 0 0 0 0];
    case 22
        J=[0 0 0 1 0 Ls*cos(q(6)) 0 0 0;
            0 0 0 0 1 -Ls*sin(q(6)) 0 0 0];
        dJ=[0 0 0 0 0 -Ls*sin(q(6))*q(15) 0 0 0;
            0 0 0 0 0 -Ls*cos(q(6))*q(15) 0 0 0];
    case 23
        J=[0 0 0 1 0 (L-Ls)*cos(q(6)) 0 0 0;
            0 0 0 0 1 -(L-Ls)*sin(q(6)) 0 0 0];
        dJ=[0 0 0 0 0 -(L-Ls)*sin(q(6))*q(15) 0 0 0;
            0 0 0 0 0 -(L-Ls)*cos(q(6))*q(15) 0 0 0];
    case 24
        J=[0 0 0 1 0 L*cos(q(6)) 0 0 0;
            0 0 0 0 1 -L*sin(q(6)) 0 0 0];
        dJ=[0 0 0 0 0 -L*sin(q(6))*q(15) 0 0 0;
            0 0 0 0 0 -L*cos(q(6))*q(15) 0 0 0];
    case 31
        J=[0 0 0 0 0 0 1 0 0;
            0 0 0 0 0 0 0 1 0];
        dJ=[0 0 0 0 0 0 0 0 0;
            0 0 0 0 0 0 0 0 0];
    case 32
        J=[0 0 0 0 0 0 1 0 Ls*cos(q(9));
            0 0 0 0 0 0 0 1 -Ls*sin(q(9))];
        dJ=[0 0 0 0 0 0 0 0 -Ls*sin(q(9))*q(18);
            0 0 0 0 0 0 0 0 -Ls*cos(q(9))*q(18)];
    case 33
        J=[0 0 0 0 0 0 1 0 (L-Ls)*cos(q(9));
            0 0 0 0 0 0 0 1 -(L-Ls)*sin(q(9))];
        dJ=[0 0 0 0 0 0 0 0 -(L-Ls)*sin(q(9))*q(18);
            0 0 0 0 0 0 0 0 -(L-Ls)*cos(q(9))*q(18)];
    case 34
        J=[0 0 0 0 0 0 1 0 L*cos(q(9));
            0 0 0 0 0 0 0 1 -L*sin(q(9))];
        dJ=[0 0 0 0 0 0 0 0 -L*sin(q(9))*q(18);
            0 0 0 0 0 0 0 0 -L*cos(q(9))*q(18)];
end

end